# // 练习一

# 1. 在print语句中，如果去掉括号会怎样
# 2. 去掉print语句的双引号、或单引号会怎样
# 3. 负数我们可以写成 -2。 前面写+号会怎样？2++2呢？
# 4. 在数学符号里，填0是可以的，例如02。在python中这样写呢？
# 5. 两个数之间不带操作符会怎样？

# // 练习二

# 1. 42分42秒内有多少秒？
# 2. 10公里(kilometer)有多少英里(mile)？ 提示：1.61 kilometer = 1 mile
# 3. 在42分42秒内跑了10公里，计算你的平均速度（每秒、每分、每小时，单位 英里(mile)）


# 1.1 python2 可以不带，python3 要带括号
# 1.2 必须带双引号或单引号
# 1.3 可以写-2或+2，多个操作符衔接相当于 +0+
# 1.4 不可以
# 1.5 错误，不符合计算机语言语法


print(type('Hello, World!'))

# 2.1

print(42 * 60 + 42)

# 2.2

print(10 / 1.61)
print(type(10 / 1.61))

# 2.3

print(10 / (42 * 60 + 42))


